{"kind":"article","abstract":[{"type":"text","text":"All information herein is either public information or is the property of and owned solely by Thales and\/or its subsidiaries and affiliates who shall have and keep the sole right to file patent applications or any other kind of intellectual property protection in connection with such information."}],"primaryContentSections":[{"content":[{"text":"Overview","type":"heading","level":2,"anchor":"overview"},{"inlineContent":[{"type":"text","text":"Nothing herein shall be construed as implying or granting to you any rights, by license, grant or otherwise, under any intellectual and\/or industrial property rights of or concerning any of Thales and any of its subsidiaries and affiliates (collectively referred to herein after as “Thales”) information."}],"type":"paragraph"},{"type":"paragraph","inlineContent":[{"text":"This document can be used for informational, non-commercial, internal, and personal use only provided that:","type":"text"}]},{"items":[{"content":[{"inlineContent":[{"text":"The copyright notice below, the confidentiality and proprietary legend and this full warning notice appear in all copies.","type":"text"}],"type":"paragraph"}]},{"content":[{"type":"paragraph","inlineContent":[{"text":"This document shall not be posted on any publicly accessible network computer or broadcast in any media, and no modification of any part of this document shall be made.","type":"text"}]}]}],"type":"unorderedList"},{"inlineContent":[{"text":"Use for any other purpose is expressly prohibited and may result in severe civil and criminal liabilities.","type":"text"}],"type":"paragraph"},{"type":"paragraph","inlineContent":[{"type":"text","text":"The information contained in this document is provided “AS IS” without any warranty of any kind. Unless otherwise expressly agreed in writing, Thales makes no warranty as to the value or accuracy of information contained herein."}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"The document could include technical inaccuracies or typographical errors. Changes are periodically added to the information herein. Furthermore, Thales reserves the right to make any change or improvement in the specifications data, information, and the like described herein, at any time."}]},{"inlineContent":[{"type":"text","text":"Thales hereby disclaims all warranties and conditions with regard to the information contained herein, including all implied warranties of merchantability, fitness for a particular purpose, title and non-infringement. In no event shall Thales be liable, whether in contract, tort or otherwise, for any indirect, special or consequential damages or any damages whatsoever including but not limited to damages resulting from loss of use, data, profits, revenues, or customers, arising out of or in connection with the use or performance of information contained in this document."}],"type":"paragraph"},{"type":"paragraph","inlineContent":[{"type":"text","text":"Thales does not and shall not warrant that this product will be resistant to all possible attacks and shall not incur, and disclaims, any liability in this respect. Even if each product is compliant with current security standards in force on the date of their design, security mechanisms’ resistance necessarily evolves according to the state of the art in security and notably under the emergence of new attacks. Under no circumstances, shall Thales be held liable for any third party actions and in particular in case of any successful attack against systems or equipment incorporating Thales products. Thales disclaims any liability with respect to security for direct, indirect, incidental or consequential damages that result from any use of its products. It is further stressed that independent testing and verification by the person using the product is particularly encouraged, especially in any application in which defective, incorrect or insecure functioning could result in damage to persons or property, denial of service, or loss of privacy."}]},{"type":"paragraph","inlineContent":[{"type":"text","text":"Copyright © 2026. All rights reserved. Thales and the Thales logo are trademarks and service marks of Thales and\/or its subsidiaries and affiliates and are registered in certain countries. All other trademarks and service marks, whether registered or not in specific countries, are the property of their respective owners."}]},{"inlineContent":[{"text":"The open source licenses and components used by this product can be found in the license folder of the delivery package.","type":"text"}],"type":"paragraph"}],"kind":"content"}],"variants":[{"paths":["\/documentation\/d1\/terms-of-use"],"traits":[{"interfaceLanguage":"swift"}]}],"metadata":{"modules":[{"name":"D1"}],"title":"Terms of use","role":"article","roleHeading":"Article"},"schemaVersion":{"minor":3,"patch":0,"major":0},"hierarchy":{"paths":[["doc:\/\/D1\/documentation\/D1"]]},"sections":[],"identifier":{"url":"doc:\/\/D1\/documentation\/D1\/Terms-of-use","interfaceLanguage":"swift"},"references":{"doc://D1/documentation/D1":{"abstract":[],"title":"D1","type":"topic","kind":"symbol","role":"collection","identifier":"doc:\/\/D1\/documentation\/D1","url":"\/documentation\/d1"}}}